Tekla Open API Reference for Tekla Structures 2025
Distance.ToFractionalFeetAndInchesString Method
 Creates a string representation of the distance in feet and inches.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToFractionalFeetAndInchesString()
Public Function ToFractionalFeetAndInchesString As String
Return Value
Type: String
The string representation of the distance.
Examples
 This example shows how to convert a Distance instance into a fractional string representation of feet and inches.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           string formattedString = distance.ToFractionalFeetAndInchesString();
       }
}
See Also
Reference
Distance Structure
ToFractionalFeetAndInchesString Overload
Tekla.Structures.Datatype Namespace